#pragma once
//За първото контролно професор ЧЧ е решил да разположи всички участници в една редица един зад друг.Всеки участник е получил един вариант на контролното.За жалост един участник, Коцето, е закъснял.ЧЧ има точно един останал вариант на контролното и се чуди къде да разпожи Коцето, така че да е най - далеч от останалите участници със същия вариант.За да помогнете на ЧЧ трябва за всеки участник да кажете какво е най - малкото разстояние от него до най - близкия участник с варианта на Коцето.
//
//Input Format
//
//За улеснение вариантите ще са малки букви от латинската азбука.
//
//На първият ред ще получите 1 дума представляваща последователност от вариантите на всички участници един след друг.Думата ще има  на брой символа.
//
//На втория ред ще получите един символ - варианта, който е останал за Коцето.
//
//Constraints
//
//
//Output Format
//
//На един ред изведете разделени с празно място(спейс) разстоянията на всеки един участник до най - близкия вариант, който получава Коцето.Резултата трябва да е в същата наредба, в която са зададени участниците на входа.
//
//Sample Input 0
//
//abaaa
//b
//
//Sample Output 0
//
//1 0 1 2 3