#pragma once
//
//Разполагате с логове от критична система.За съжаление, времената на логовете са се разбъркали.Вашата задача е да укажете правилния ред на всички записани логове.
//
//Input Format
//
//На първият ред на стандартния вход получавате цяло число N.
//
//На следващите N реда прочитате N на брой timestamp - a.
//
//Всеки timestamp е във формат HH : MM:SS DD.MM.YYYY
//
//Constraints
//
//
//
//Output Format
//
//На N реда в стандартния изход изведете правилната подредба на логовете, започвайки от този, който е най - рано във времето.Използвайте индексите им от входа, като логовете са номерирани от 1 до N.
//
//Sample Input 0
//
//4
//22:44 : 05 11.04.2021
//13 : 12 : 21 31.08.2017
//10 : 41 : 28 23.10.2021
//08 : 00 : 45 08.01.2016
//Sample Output 0
//
//4
//2
//1
//3